const translations = {
  //MENU
  home_menu_label: 'Hачало',
  login_menu_label: 'Вход',
  register_menu_label: 'Регистрация',
  reset_pass_menu_label: 'Нулирай парола',
  rents_menu_label: 'Наеми',
  estates_for_sale_menu_label: 'Имоти за продажба',
  terms_menu_label: 'Условия за ползване',
  my_rent_requests_menu_label: 'Заявки за наем',
  my_estate_offers_menu_label: 'Заявки за имот',
  my_sent_messages_menu_label: 'Изпратени заявки',
  reports_menu_label: 'Отчети',
  logout_menu_label: 'Изход',
  language: 'Език',
  language_bulgarian: 'Български',
  language_english: 'Английски',

  //HOME
  second_header: 'Помага на хората с управлението на имоти',
  about_us: 'За нас',
  about_us_text:
    'Ние сме екип от технически грамотни хора, които разбират значението на ефективното управление на имоти в днешния забързан свят. Нашата цел е да революционизираме начина, по който хората управляват своите имоти, правейки го по-лесно, по-организирано и по-малко стресиращо.',
  the_idea_behind: 'Идеята зад нашето приложение за управление на имоти',
  the_idea_behind_text:
    'Забелязахме често срещан проблем сред собствениците на имоти - управлението на имотите им беше досадна, отнемаща време задача, която отне от други важни аспекти от живота им. От следенето на наемателите и техните плащания до поддържането на имота, управлението на имоти може да бъде огромно. А с традиционните методи като хартиени записи и ръчно управление беше лесно важна информация да бъде загубена или пренебрегната.',
  inspired_solution_text:
    'Това ни вдъхнови да създадем решение, което да опрости управлението на имоти за обикновения потребител. Нашето приложение за управление на имоти е предназначено да улесни живота ви, като ви предостави централизирана платформа за управление на всички аспекти на вашия имот. С актуализации в реално време, 24/7 достъп и сигурно съхранение на данни, нашето приложение ви улеснява да следите всичко отвсякъде и по всяко време.',
  our_mission: 'Нашата мисия',
  our_mission_text:
    'Нашата мисия е да предоставим на собствениците на имоти ефективно и удобно за потребителя решение за управление на техните имоти. Ние вярваме, че всеки трябва да има достъп до инструменти, които улесняват живота му, и ние сме посветени на предоставянето на точно това. Нашият екип непрекъснато работи за подобряване на приложението ни и добавяне на нови функции, които ще направят управлението на имоти лесно.',
  why_choose: 'Защо да изберете нашето приложение за управление на имоти',
  why_choose_text:
    'Нашето приложение за управление на имоти е проектирано с мисъл за потребителя. Ние разбираме важността на наличието на система, която е лесна за използване, достъпна и сигурна. Нашето приложение предлага:',
  why_choose_li_1:
    'Безпроблемно управление на имоти: Нашето приложение рационализира всички аспекти на управлението на имоти, от поддръжката на имота до отношенията с наемателите.',
  why_choose_li_2:
    'Актуализации в реално време: Нашето приложение предоставя актуализации в реално време, така че да можете да останете на върха на всичко, което се случва с вашето място за настаняване.',
  why_choose_li_3:
    '24/7 достъп: С 24/7 достъп можете да управлявате имота си от всяко място и по всяко време.',
  why_choose_li_4:
    'Сигурно съхранение на данни: Ние разбираме важността на запазването на вашата информация в безопасност, поради което използваме най-съвременните мерки за сигурност, за да гарантираме, че вашите данни винаги са защитени.',
  conclusion:
    'В заключение, нашето приложение за управление на имоти е създадено, за да улесни живота ви. Със своя удобен за потребителя интерфейс, актуализации в реално време и 24/7 достъп, управлението на вашия имот никога не е било по-лесно. Опитайте го днес и вижте разликата за себе си!',

  //Auth
  email: 'Имейл',
  password: 'Парола',
  repeat_password: 'Повтори парола',
  missing_email_error: 'Моля въведете имейл!',
  wrong_email_format: 'Невалиден формат на имейла!',
  missing_password_error: 'Моля въведете парола!',
  password_length_error: 'Паролата не може да бъде по-къса от 6 символа',
  passwords_miss_match: 'Паролите не съвпадат',

  //Rents
  rent_description: 'Описание',
  rent_reviews: 'Ревю',
  rent_status: 'Статус',
  rent_status_rentable: 'Свободно',
  rent_status_occupied: 'Заето',
  rent_status_minimal_rent_time: 'Минимален период на наемане',
  rent_state_poor: 'Слабо',
  rent_state_neutral: 'Неутрално',
  rent_state_good: 'Добро',
  rent_state_very_good: 'Много добро',
  rent_state_excellent: 'Перфектно',
  rent_location_desolate: 'Пусто',
  rent_location_neutral: 'Неутрално',
  rent_location_lively: 'Живо',
  rent_location_very_busy: 'Много шумно',
  rent_review_star_1: 'Ужасно',
  rent_review_star_2: 'Лошо',
  rent_review_star_3: 'Нормално',
  rent_review_star_4: 'Добро',
  rent_review_star_5: 'Прекрасно',
  rent_modal_header: 'Оставете вашето ревю...',
  rent_months_label: 'Месеци под наем',
  rent_description_label: 'Описание',
  rent_state_label: 'Състояние на обект',
  rent_location_label: 'Локационен фактор',
  rent_modal_cancel_btn: 'Прекрати',
  rent_modal_ok_btn: 'Потвърди',
  rent_estate_name: 'Име на имота',
  rent_location: 'Локация',
  rent_per_month: 'Наем / месец',
  rent_image_link: 'Изображение',
  rent_add_button: 'Добави имот за наем',
  rent_apply: 'Заяви наема',
  rent_update: 'Промени наема',
  rent_delete: 'Изтрий наема',
  rent_renew: 'Поднови наем',
  monthly: 'месечно',
  price: 'Цена',
  months: 'Месеца',
  reviews: 'Ревюта',
  update_review: 'Промени Ревю',
  delete_review: 'Изтрий Ревю',
};

export default translations;
