const translations = {
  //MENU
  home_menu_label: 'Hачало',
  login_menu_label: 'Вход',
  register_menu_label: 'Регистрация',
  reset_pass_menu_label: 'Нулирай парола',
  rents_menu_label: 'Наеми',
  estates_for_sale_menu_label: 'Имоти за продажба',
  terms_menu_label: 'Условия за ползване',
  my_rent_requests_menu_label: 'Заявки за наем',
  my_estate_offers_menu_label: 'Заявки за имот',
  my_sent_messages_menu_label: 'Изпратени заявки',
  reports_menu_label: 'Отчети',
  logout_menu_label: 'Изход',
  language: 'Език',
  language_bulgarian: 'Български',
  language_english: 'Английски',

  //HOME
  second_header: 'Помага на хората с управлението на имоти',
  about_us: 'За нас',
  about_us_text:
    'Ние сме екип от технически грамотни хора, които разбират значението на ефективното управление на имоти в днешния забързан свят. Нашата цел е да революционизираме начина, по който хората управляват своите имоти, правейки го по-лесно, по-организирано и по-малко стресиращо.',
  the_idea_behind: 'Идеята зад нашето приложение за управление на имоти',
  the_idea_behind_text:
    'Забелязахме често срещан проблем сред собствениците на имоти - управлението на имотите им беше досадна, отнемаща време задача, която отне от други важни аспекти от живота им. От следенето на наемателите и техните плащания до поддържането на имота, управлението на имоти може да бъде огромно. А с традиционните методи като хартиени записи и ръчно управление беше лесно важна информация да бъде загубена или пренебрегната.',
  inspired_solution_text:
    'Това ни вдъхнови да създадем решение, което да опрости управлението на имоти за обикновения потребител. Нашето приложение за управление на имоти е предназначено да улесни живота ви, като ви предостави централизирана платформа за управление на всички аспекти на вашия имот. С актуализации в реално време, 24/7 достъп и сигурно съхранение на данни, нашето приложение ви улеснява да следите всичко отвсякъде и по всяко време.',
  our_mission: 'Нашата мисия',
  our_mission_text:
    'Нашата мисия е да предоставим на собствениците на имоти ефективно и удобно за потребителя решение за управление на техните имоти. Ние вярваме, че всеки трябва да има достъп до инструменти, които улесняват живота му, и ние сме посветени на предоставянето на точно това. Нашият екип непрекъснато работи за подобряване на приложението ни и добавяне на нови функции, които ще направят управлението на имоти лесно.',
  why_choose: 'Защо да изберете нашето приложение за управление на имоти',
  why_choose_text:
    'Нашето приложение за управление на имоти е проектирано с мисъл за потребителя. Ние разбираме важността на наличието на система, която е лесна за използване, достъпна и сигурна. Нашето приложение предлага:',
  why_choose_li_1:
    'Безпроблемно управление на имоти: Нашето приложение рационализира всички аспекти на управлението на имоти, от поддръжката на имота до отношенията с наемателите.',
  why_choose_li_2:
    'Актуализации в реално време: Нашето приложение предоставя актуализации в реално време, така че да можете да останете на върха на всичко, което се случва с вашето място за настаняване.',
  why_choose_li_3:
    '24/7 достъп: С 24/7 достъп можете да управлявате имота си от всяко място и по всяко време.',
  why_choose_li_4:
    'Сигурно съхранение на данни: Ние разбираме важността на запазването на вашата информация в безопасност, поради което използваме най-съвременните мерки за сигурност, за да гарантираме, че вашите данни винаги са защитени.',
  conclusion:
    'В заключение, нашето приложение за управление на имоти е създадено, за да улесни живота ви. Със своя удобен за потребителя интерфейс, актуализации в реално време и 24/7 достъп, управлението на вашия имот никога не е било по-лесно. Опитайте го днес и вижте разликата за себе си!',

  //Auth
  email: 'Имейл',
  password: 'Парола',
  repeat_password: 'Повтори парола',
  missing_email_error: 'Моля въведете имейл!',
  wrong_email_format: 'Невалиден формат на имейла!',
  missing_password_error: 'Моля въведете парола!',
  password_length_error: 'Паролата не може да бъде по-къса от 6 символа',
  passwords_miss_match: 'Паролите не съвпадат',
  reset_pass_message: 'Заявката е успешна',
  reset_pass_description: 'Проверете електронната си поща за изпратено съобщение от Estate Manager',

  //Rents
  rent_request_header: 'Въведете вашата заявка...',
  rent_request_modal_message: 'Съобщение',
  rent_modal_add_header: 'Добави следната информацията...',
  rent_description: 'Описание',
  rent_reviews: 'Ревю',
  rent_status: 'Статус',
  rent_status_rentable: 'Свободно',
  rent_status_occupied: 'Заето',
  rent_status_minimal_rent_time: 'Минимален период наем',
  rent_state_poor: 'Слабо',
  rent_state_neutral: 'Неутрално',
  rent_state_good: 'Добро',
  rent_state_very_good: 'Много добро',
  rent_state_excellent: 'Перфектно',
  rent_location_desolate: 'Пусто',
  rent_location_neutral: 'Неутрално',
  rent_location_lively: 'Живо',
  rent_location_very_busy: 'Много шумно',
  rent_review_star_1: 'Ужасно',
  rent_review_star_2: 'Лошо',
  rent_review_star_3: 'Нормално',
  rent_review_star_4: 'Добро',
  rent_review_star_5: 'Прекрасно',
  rent_modal_header: 'Оставете вашето ревю...',
  rent_months_label: 'Месеци под наем',
  rent_description_label: 'Описание',
  rent_state_label: 'Състояние на обект',
  rent_location_label: 'Локационен фактор',
  rent_modal_cancel_btn: 'Прекрати',
  rent_modal_ok_btn: 'Потвърди',
  rent_estate_name: 'Име на имота',
  rent_location: 'Локация',
  rent_per_month: 'Наем / месец',
  rent_minimal_rent_time: 'Минимален период',
  rent_image_link: 'Изображение',
  rent_add_button: 'Добави имот за наем',
  rent_apply: 'Заяви наем',
  rent_update: 'Промени наема',
  rent_delete: 'Изтрий наема',
  rent_renew: 'Поднови наем',
  monthly: 'месечно',
  price: 'Цена',
  months: 'Месеца',
  reviews: 'Ревюта',
  update_review: 'Промени Ревю',
  delete_review: 'Изтрий Ревю',

  //Table headers
  table_image: 'Снимка',
  table_name: 'Име',
  table_location: 'Локация',
  table_rent: 'Наем',
  table_renter: 'Наемател',
  table_date: 'Дата',
  table_message: 'Съобщение',
  table_actions: 'Действия',
  table_approve: 'Одобри',
  table_decline: 'Откажи',
  table_offered_price: 'Предложена цена',
  table_offered_by: 'Предложено от',
  table_receiver: 'Получател',
  table_update: 'Обнови',
  table_delete: 'Изтрий',
  table_status: 'Статус',
  table_no_data: 'Няма данни',
  table_sold_to: 'Продадено на',
  table_price: 'Цена',

  //Reports
  reports_header: 'Отчети',
  reports_export: 'Експорт',
  reports_total: 'Общо',
  reports_rents: 'Наеми',
  reports_estates: 'Имоти',
  reports_period: 'Период',
  reports_multiply: 'Наем*месеци',

  //Terms:
  terms_header: 'Условия за ползване на приложението Estate Manager',
  term_1:
    'Приемане на Условията: С достъпа до или използването на уеб приложението за онлайн управление на имоти ("Приложението"), Вие се съгласявате да бъдете обвързани от настоящите Общи условия ("Условия"). Ако не сте съгласни с тези Условия, не можете да използвате Приложението.',
  term_2:
    'Потребителски акаунти: За да получите достъп до определени функции на Приложението, може да се наложи да създадете потребителски акаунт. Вие носите отговорност за поддържането на поверителността на информацията за профила си, включително вашето потребителско име и парола. Вие се съгласявате да ни уведомите незабавно за всяко неоторизирано използване на Вашия акаунт.',
  term_3:
    'Използване на Приложението: Вие се съгласявате да използвате Приложението единствено по предназначение, което е да управлява и организира задачи и информация, свързани с имоти. Не трябва да използвате Приложението за незаконни, измамни или неразрешени цели.',
  term_4:
    'Потребителско съдържание: Можете да изпращате съдържание, като текст, изображения и други материали ("Потребителско съдържание"), към Приложението. С изпращането на Потребителско съдържание, Вие ни предоставяте неизключителен, безвъзмезден, вечен, неотменим и световен лиценз за използване, възпроизвеждане, промяна, адаптиране, публикуване, превод, разпространение и показване на такова Потребителско съдържание във връзка с Приложението.',
  term_5:
    'Интелектуална собственост: Приложението и цялото му съдържание, включително, но не само, текст, графики, лога, икони, изображения, аудио клипове и софтуер, са собственост на нас или на нашите лицензодатели и са защитени от приложимите закони за интелектуална собственост. Нямате право да копирате, променяте, възпроизвеждате, разпространявате, предавате, показвате или по друг начин използвате каквото и да е съдържание от Приложението без нашето предварително писмено съгласие.',
  term_6:
    'Поверителност: Ние събираме и използваме лична информация в съответствие с нашата Политика за поверителност, която е включена в тези Условия чрез препратка. Използвайки Приложението, Вие се съгласявате със събирането и използването на Вашата лична информация, както е описано в нашата Политика за поверителност.',
  term_7:
    'Забранено поведение: Не трябва да използвате Приложението, за да: (а) качвате, публикувате, изпращате имейли или по друг начин предавате съдържание, което е незаконно, вредно, заплашително, обидно, тормозещо, клеветническо, вулгарно, нецензурно, клеветническо, нарушаващо неприкосновеността на личния живот на друго лице или расово, етнически или по друг начин нежелателно;  (б) да се представяте за физическо или юридическо лице или невярно да заявявате или по друг начин да представяте погрешно връзката си с физическо или юридическо лице; (в) качване, публикуване, изпращане по електронна поща или по друг начин предаване на нежелана или неразрешена реклама, промоционални материали, "нежелана поща", "спам", "верижни писма", "пирамидални схеми" или всяка друга форма на привличане;(г) качвате, публикувате, изпращате имейли или по друг начин предавате съдържание, което съдържа вируси, червеи или друг компютърен код, файлове или програми, които могат да прекъсват, унищожават или ограничават функционалността на компютърен софтуер или хардуер или телекомуникационно оборудване; или (д) да се намесвате или да нарушавате Приложението или сървърите или мрежите, свързани с Приложението, или да не се подчинявате на каквито и да е изисквания, процедури, политики или разпоредби на мрежите, свързани с Приложението.',
  term_8:
    'Обезщетение: Вие се съгласявате да ни обезщетите и да ни държите безвредни от и срещу всякакви искове, задължения, щети, загуби, разходи и разноски, включително разумни адвокатски хонорари, произтичащи от или по някакъв начин свързани с използването на Приложението или всяко нарушение на тези Условия.',
  term_9:
    'Отказ от гаранции: ЗАЯВЛЕНИЕТО СЕ ПРЕДОСТАВЯ НА БАЗА "КАКТО Е" И "КАКТО Е НАЛИЧНО", БЕЗ ГАРАНЦИИ ОТ КАКЪВТО И ДА Е ВИД, ИЗРИЧНИ ИЛИ ПОДРАЗБИРАЩИ СЕ. НИЕ ОТХВЪРЛЯМЕ ВСИЧКИ ГАРАНЦИИ, ВКЛЮЧИТЕЛНО, НО НЕ САМО, ГАРАНЦИИ ЗА ПРОДАВАЕМОСТ, ПРИГОДНОСТ ЗА ОПРЕДЕЛЕНА ЦЕЛ И НЕНАРУШЕНИЕ. НИЕ НЕ ГАРАНТИРАМЕ, ЧЕ ПРИЛОЖЕНИЕТО ЩЕ БЪДЕ НЕПРЕКЪСНАТО, БЕЗ ГРЕШКИ ИЛИ СИГУРНО.',
  term_10:
    'Ограничаване на отговорността: В НИКАКЪВ СЛУЧАЙ НЕ НОСИМ ОТГОВОРНОСТ ЗА КАКВИТО И ДА БИЛО КОСВЕНИ, СЛУЧАЙНИ, СПЕЦИАЛНИ, ПОСЛЕДВАЩИ ИЛИ ПРИМЕРНИ',

  //Confirm modal
  confirmation: 'Потвърждение',
  confirmation_text:
    'Наистина ли искате да изтриете окончателно този елемент от списъка на системата? Действието не може да бъде върнато!',
  confirmation_submit_btn: 'Потвърди',
  confirmation_cancel_btn: 'Прекрати',
  decline_message: 'Наистина ли искате да откажете тази оферта?',
  approve_message: 'Наистина ли искате да приемете тази оферта?',

  //Estates
  estate_starting_price: 'Начална Цена',
  estate_name: 'Наименование',
  estate_year: 'Година',
  estate_bid_step: 'Наддаване',
  estate_area: 'Площ',
  estate_location: 'Локация',
  estate_status: 'Статус',
  estate_description: 'Описание',
  estate_edit: 'Промени',
  estate_delete: 'Изтрий',
  estate_apply_to_buy: 'Заяви покупка',
  estate_status_sold: 'Продадено',
  estate_status_for_sale: 'Продава се',
  estate_application_text: 'Попълнете вашата заявка...',
  estate_message: 'Съобщение',
  estate_message_required: 'Моля въведете вашето съобщение!',
  estate_message_short: 'Съобщението не може да бъде по-кратко от 10 символа!',
  estate_offer_price: 'Предложена цена',
  estate_offer_price_required: 'Въведете вашата оферта!',
  estate_offer_price_numerical: 'Изполвайте само числови стойности!',
  estate_offer_price_positive: 'Използвайте само положителни числа!',
  estate_add_info: 'Въведете следната информация...',
  estate_image_url: 'Линк',
  estate_publish_offer: 'Публикувай обява',

  //Error messages
  estate_name_required: 'Моля въведете наименование',
  estate_name_short: 'Наименованието не може да бъде по-кратко от 3 символа',
  estate_location_required: 'Моля въведете локация',
  estate_location_short: 'Локацията не може да бъде по-кратка от 5 символа',
  estate_starting_price_required: 'Въведете начална цена',
  estate_numerical: 'Ползвайте само числови стойности',
  estate_positive: 'Ползваите само положителни стойности',
  estate_bid_step_required: 'Въведете стъпка на наддаване',
  estate_year_error: 'Въведете дата на застрояване',
  estate_year_gap:
    'Годината не може да бъде по-малка от 1800 и по-голяма от сегашната година (2023)',
  estate_area_required: 'Въведете площ',
  estate_description_required: 'Въведете описание',
  estate_description_short: 'Описанието не може да бъде по-кратко от 10 символа',
  estate_one_image: 'Поне една снимка',
  estate_image_url_required: 'Въведете линк',
  estate_add_image: 'Добави снимка',

  auth_something_wrong: 'Уупс, нещо се обърка...',
  auth_error_description: 'Моля проверете вашия емайл или парола',
  auth_error_email_used: 'Някой вече ползва този емайл, пробвайте с друг',
  auth_error_email_description: 'Моля проверете вашия емайл',

  rent_name_required: 'Моля въведете наименование',
  rent_name_short: 'Наименованието не може да бъде по-кратко от 3 символа',
  rent_location_required: 'Моля въведете локация',
  rent_location_short: 'Локацията не може да бъде по-кратка от 5 символа',
  rent_location_invalid: 'Проверете отново локацията',
  rent_rent_required: 'Моля въведете наем',
  rent_numerical: 'Ползвайте само числови стойности',
  rent_positive: 'Ползвайте само положителни стойности',
  rent_description_required: 'Моля въвете описание',
  rent_description_short: 'Описанието не може да бъде по-кратко от 10 символа',
  rent_minimal: 'Въведете минимален период',
  rent_image_link: 'Въведете линк',
  rent_image_link_invalid: 'Ползвайте валиден линк, започващ с https://',

  rent_request_message_required: 'Въведетe вашето съобщение!',
  rent_request_message_short: 'Съобщението не може да бъде по-кратко от 10 символа!',

  rent_review_months_required: 'Въведете времето на престой',
  rent_review_numerical: 'Ползвайте само числови стойности',
  rent_review_positive: 'Ползвайте само положителни стойности',
  rent_review_state_required: 'Въведете състояние на имота',
  rent_review_location_factor: 'Въведете локационен фактор',
};

export default translations;
